spring-petclinic-soap-service/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getAnimalRequest>
            <gs:name>Gepard</gs:name>
        </gs:getAnimalRequest>
    </soapenv:Body>
</soapenv:Envelope>
